#+TITLE: Deploy To Pair

Create namespace for components:
#+BEGIN_SRC shell :results silent
kubectl create ns prow-${SHARINGIO_PAIR_NAME}
#+END_SRC

#+BEGIN_SRC shell :results silent
kubectl label ns prow-$SHARINGIO_PAIR_NAME cert-manager-tls=sync --overwrite
#+END_SRC

Create namespace for workloads:
#+BEGIN_SRC shell :results silent
kubectl create ns prow-${SHARINGIO_PAIR_NAME}-workloads
#+END_SRC

Create the values for the deployment:
#+BEGIN_SRC yaml :tangle ./prow.yaml
apiVersion: helm.fluxcd.io/v1
kind: HelmRelease
metadata:
  name: prow-${SHARINGIO_PAIR_NAME}
spec:
  chart:
    git: https://github.com/cncf-infra/prow-config
    path: charts/prow
    ref: e063bb6ca15b52fd6525608c2781064cc16bc36b
  releaseName: prow-${SHARINGIO_PAIR_NAME}
  values:
    podNamespace: prow-${SHARINGIO_PAIR_NAME}-workloads
    githubFromSecretRef:
      enabled: true
      oauth:
        name: "prow-github-oauth"
      hmac:
        name: "prow-github-hmac"

    ingress:
      certmanager:
        enabled: false
      hosts:
        - host: prow.${SHARINGIO_PAIR_BASE_DNS_NAME}
      tls:
        - secretName: letsencrypt-prod
          hosts:
            - prow.${SHARINGIO_PAIR_BASE_DNS_NAME}

    configFromConfigMap:
      enabled: true
      name: "prow-config"

    plugins:
      # config-updater
      # update prow cluster's configmaps from the repo with this plugin enabled; assumed to be a single repo
      config_updater:
        maps:
          config.yaml:
            name: config
          plugins.yaml:
            name: plugins
          jobs/**/*.yaml:
            name: job-config

      # which plugins should be enabled for which orgs or org/repos
      plugins:
        cncf-infra:
          # - approve
          - assign
          #- cat
          #- dog
          - hold
          - label
          - lgtm
          # - owners-label
          - shrug
          - size
          - skip
          - trigger
          - wip
          # - verify-owners
          - yuks

* Handy scripts

Template the local HelmRelease:
#+BEGIN_SRC shell
helm upgrade -i prow-${SHARINGIO_PAIR_NAME} \
    -n prow-${SHARINGIO_PAIR_NAME} \
    -f <(envsubst < <(cat prow.yaml | yq e '.spec.values' -P -)) \
    ~/prow-config/charts/prow/
#+END_SRC

#+RESULTS:
#+begin_example
Release "prow-bobymcbobs" has been upgraded. Happy Helming!
NAME: prow-bobymcbobs
LAST DEPLOYED: Mon May  3 13:57:16 2021
NAMESPACE: prow-bobymcbobs
STATUS: deployed
REVISION: 2
TEST SUITE: None
NOTES:
1. Get the application URL by running these commands:
#+end_example

Template what's applied in cluster:
#+BEGIN_SRC shell
helm template --debug prow-${SHARINGIO_PAIR_NAME} \
    -n prow-${SHARINGIO_PAIR_NAME} \
    -f <(\
      kubectl -n prow-${SHARINGIO_PAIR_NAME} \
      get helmreleases.helm.fluxcd.io prow-${SHARINGIO_PAIR_NAME} \
      -o=jsonpath='{.spec.values}' | yq e -P \
    ) ~/prow-config/charts/prow/
#+END_SRC

Rollout restart
#+BEGIN_SRC shell
kubectl -n prow-${SHARINGIO_PAIR_NAME} rollout restart $(kubectl -n prow-${SHARINGIO_PAIR_NAME} get deployments -o=jsonpath='{range .items[*]}{.kind}/{.metadata.name} {end}')
#+END_SRC

#+RESULTS:
#+begin_example
deployment.apps/prow-bobymcbobs-sdfg-crier restarted
deployment.apps/prow-bobymcbobs-sdfg-deck restarted
deployment.apps/prow-bobymcbobs-sdfg-ghproxy restarted
deployment.apps/prow-bobymcbobs-sdfg-hook restarted
deployment.apps/prow-bobymcbobs-sdfg-horologium restarted
deployment.apps/prow-bobymcbobs-sdfg-minio restarted
deployment.apps/prow-bobymcbobs-sdfg-plank restarted
deployment.apps/prow-bobymcbobs-sdfg-sinker restarted
deployment.apps/prow-bobymcbobs-sdfg-statusreconciler restarted
deployment.apps/prow-bobymcbobs-sdfg-tide restarted
#+end_example

Clean up workloads
#+BEGIN_SRC shell
kubectl -n prow-${SHARINGIO_PAIR_NAME}-workloads delete pods --force --grace-period=0 --all
#+END_SRC

Get logs for component
#+BEGIN_SRC shell
kubectl -n prow-${SHARINGIO_PAIR_NAME} logs -l app.kubernetes.io/component=hook --tail=100
#+END_SRC

Get all logs
#+BEGIN_SRC shell
kubectl -n prow-${SHARINGIO_PAIR_NAME} logs -l app.kubernetes.io/name=prow -f --tail=100 --max-log-requests 100 --prefix
#+END_SRC

Get gencred
#+BEGIN_SRC shell :results silent :dir (concat (getenv "HOME") "/test-infra")
go install ./gencred
#+END_SRC

Generate a Kubeconfig for use in Prow
#+BEGIN_SRC shell
set -x
CRED_NEW_CONTEXT=default
CRED_EXISTING_CONTEXT=in-cluster
CRED_SERVICEACCOUNT=${SHARINGIO_PAIR_NAME}-humacs
CRED_OUTPUT=/tmp/${SHARINGIO_PAIR_NAME}-kubeconfig-admin
gencred \
    -n $CRED_NEW_CONTEXT \
    --context $CRED_EXISTING_CONTEXT \
    -s ${SHARINGIO_PAIR_NAME}-humacs \
    --overwrite \
    -o $CRED_OUTPUT
ls -alh $CRED_OUTPUT
#+END_SRC

